ðŸ“– Scenario:
At a small college called Coffee & Courses, students enroll in various majors and often enjoy drinks at the campus cafÃ©. We'll create a database with two tables:

students â€“ Student details

purchases â€“ Drink purchase history at the cafÃ©

ðŸ§± SQL: Create Tables & Insert Sample Data

In [1]:
import sqlite3
import pandas as pd

In [3]:
conn = sqlite3.connect('coffee_courses.db')
cursor = conn.cursor()

In [ ]:
# Create a connection to the SQLite3 database
conn = sqlite3.connect('coffee_courses.db')
cursor = conn.cursor()

# Create Students Table
# This table stores information about students.
# Fields:
# - student_id: A unique identifier for each student (Primary Key).
# - name: The name of the student.
# - major: The major subject the student is enrolled in.
# - year: The current year of study for the student.
cursor.execute('''
CREATE TABLE IF NOT EXISTS students (
  student_id INTEGER PRIMARY KEY,
  name TEXT,
  major TEXT,
  year INTEGER
);
''')

# Create Purchases Table
# This table records the purchase history of drinks at the cafÃ©.
# Fields:
# - purchase_id: A unique identifier for each purchase (Primary Key).
# - student_id: The ID of the student who made the purchase (Foreign Key referencing students table).
# - item: The name of the drink purchased.
# - price: The cost of the drink.
# - purchase_date: The date when the purchase was made.
cursor.execute('''
CREATE TABLE IF NOT EXISTS purchases (
  purchase_id INTEGER PRIMARY KEY,
  student_id INTEGER,
  item TEXT,
  price REAL,
  purchase_date TEXT,
  FOREIGN KEY(student_id) REFERENCES students(student_id)
);
''')

# Insert Sample Students
# Adding sample data to the students table.
cursor.executemany('''
INSERT INTO students (student_id, name, major, year) VALUES (?, ?, ?, ?)
''', [
    (1, 'Alice', 'Computer Science', 2),
    (2, 'Bob', 'Economics', 3),
    (3, 'Charlie', 'Psychology', 1),
    (4, 'Dana', 'Computer Science', 3),
    (5, 'Eli', 'Economics', 2)
])

# Insert Sample Purchases
# Adding sample data to the purchases table.
cursor.executemany('''
INSERT INTO purchases (purchase_id, student_id, item, price, purchase_date) VALUES (?, ?, ?, ?, ?)
''', [
    (101, 1, 'Espresso', 2.5, '2025-05-20'),
    (102, 1, 'Latte', 3.5, '2025-05-21'),
    (103, 2, 'Cappuccino', 4.0, '2025-05-20'),
    (104, 3, 'Tea', 2.0, '2025-05-22'),
    (105, 4, 'Latte', 3.5, '2025-05-22'),
    (106, 5, 'Espresso', 2.5, '2025-05-22'),
    (107, 5, 'Latte', 3.5, '2025-05-23'),
    (108, 4, 'Tea', 2.0, '2025-05-24')
])

# Commit the changes and close the connection
conn.commit()

In [9]:
conn.close()

ðŸŽ“ SQL Exercises by Topic

### 1.List all students in their 2nd year

In [4]:
query = '''SELECT name FROM students 
WHERE year = 2'''
df = pd.read_sql_query(query, conn)
print(df)

    name
0  Alice
1    Eli

### 2.Which students are majoring in Computer Science?

In [ ]:
query = "SELECT name FROM students WHERE major = 'Computer Science';"
df = pd.read_sql_query(query, conn)
print(df)

### 3.What purchases were made on '2025-05-22'?

In [ ]:
query = "SELECT * FROM purchases WHERE purchase_date = '2025-05-22';"
df = pd.read_sql_query(query, conn)
print(df)

### 4. Which items cost more than 3?

In [ ]:
query = "SELECT item FROM purchases WHERE price > 3;"
df = pd.read_sql_query(query, conn)
print(df)

### 5. Show each student's name and what they bought

In [ ]:
query = '''SELECT s.name, p.item
FROM students s
JOIN purchases p ON s.student_id = p.student_id;'''
df = pd.read_sql_query(query, conn)
print(df)

### 6. Who purchased a "Latte"?

In [ ]:
query = '''SELECT s.name
FROM students s
JOIN purchases p ON s.student_id = p.student_id
WHERE p.item = 'Latte';'''
df = pd.read_sql_query(query, conn)
print(df)

### 7. Show each studentâ€™s name, major, and price of each purchase:

In [ ]:
query = '''SELECT s.name, s.major, p.price
FROM students s
JOIN purchases p ON s.student_id = p.student_id;'''
df = pd.read_sql_query(query, conn)
print(df)

### 8. How much has each student spent in total?

In [ ]:
query = '''SELECT s.name, SUM(p.price) AS total_spent
FROM students s
JOIN purchases p ON s.student_id = p.student_id
GROUP BY s.name;'''
df = pd.read_sql_query(query, conn)
print(df)

### 9. How many purchases were made per drink type?

In [ ]:
query = '''SELECT item, COUNT(*) AS num_purchases
FROM purchases
GROUP BY item;'''
df = pd.read_sql_query(query, conn)
print(df)

### 10. What is the average price of each drink?

In [ ]:
query = '''SELECT item, AVG(price) AS avg_price
FROM purchases
GROUP BY item;'''
df = pd.read_sql_query(query, conn)
print(df)

### 11. How many students are there in each major?

In [ ]:
query = '''SELECT major, COUNT(*) AS num_students
FROM students
GROUP BY major;'''
df = pd.read_sql_query(query, conn)
print(df)

### 12. Which students spent more than 3 total?

In [ ]:
query = '''SELECT s.name, SUM(p.price) AS total_spent
FROM students s
JOIN purchases p ON s.student_id = p.student_id
GROUP BY s.name
HAVING total_spent > 3;'''
df = pd.read_sql_query(query, conn)
print(df)

### 13. Which drinks were purchased at least 3 times?

In [ ]:
query = '''SELECT item, COUNT(*) AS cnt
FROM purchases
GROUP BY item
HAVING cnt >= 3;'''
df = pd.read_sql_query(query, conn)
print(df)

### 14. Show all purchases ordered by price (descending):

In [ ]:
query = '''SELECT * FROM purchases ORDER BY price DESC;'''
df = pd.read_sql_query(query, conn)
print(df)

### 15. List student names sorted by academic year:

In [ ]:
query = '''SELECT name, year FROM students ORDER BY year;'''
df = pd.read_sql_query(query, conn)
print(df)

### 16. Show top 3 spenders:

In [ ]:
query = '''SELECT s.name, SUM(p.price) AS total_spent
FROM students s
JOIN purchases p ON s.student_id = p.student_id
GROUP BY s.name
ORDER BY total_spent DESC
LIMIT 3;'''
df = pd.read_sql_query(query, conn)
print(df)

In [ ]:
conn.close()